{
  "title": "Explain Event Delegation",
  "cells": [
    {
      "type": "markdown",
      "data": "## Explain how prototypal inheritance works\n\nPrototypal inheritance is the process of cloning existing objects that serve as prototypes. A new object is created based on an old one and this new object inherits the properties of the old.\n\n### Now, let's get more specific...\n\nBefore any code gets interpreted by the JavaScript engine, there exists a function called `Object`. You can imagine `Object` just sitting there not doing anything. It looks like this:\n```\nfunction Object() {\n  this.prototype = {\n    toString: function(){},\n    valueOf: function(){},\n    hasOwnProperty: function(){},\n    isPrototypeOf: function(){}\n  }\n}\n```\nAs you can see, `Object` has a property named `.prototype` that has a value which is an object (`{}`). Properties of `this.prototype` are methods like `toString()`, `valueOf()`, `hasOwnProperty()`, and many others.\n\nNow, let's say some code gets interpreted by the JavaScript engine and within it is a function `Foo();`. JavaScript actually creates an object and link the function `Foo` to it using the `.prototype` property. This would look something like this:\n```\nfunction Foo(name) {\n  this.prototype = {\n    // A link to Foo()\n    constructor: Foo,\n    // A linkage from the prototype to the original Object.prototype\n    __proto__: Object.prototype,\n  }\n\n  this.me = name;\n}\n```\nNotice that `.prototype` has a property called `.constructor` that links back to the `Foo()` object.\n\nSo that is what `.prototype` and `.constructor` are: linkages from a function object to its prototype property object and back from that object to the function itself.\n\nHere is an example of how you add a property to a function's `.prototype`:\n```\nFoo.prototype.person = function() {\n  return \"I am \" + this.me;\n}\n```\n\n\n\n### What do you think of AMD vs CommonJS?\n\n### Explain why the following doesn't work as an IIFE: function foo(){ }();.\n\n- What needs to be changed to properly make it an IIFE?\n\n### What's the difference between a variable that is: null, undefined or undeclared?\n\n- How would you go about checking for any of these states?\n\n### What is a closure, and how/why would you use one?\n\n### What's a typical use case for anonymous functions?\n\n### How do you organize your code? (module pattern, classical inheritance?)\n\n### What's the difference between host objects and native objects?\n\n### Difference between: function Person(){}, var person = Person(), and var person = new Person()?\n\n### What's the difference between .call and .apply?\n\n### Explain Function.prototype.bind.\n\n`.bind()` creates a function and sets the `this` value to the parameter. In this case, Function.prototype \n\n### When would you use document.write()?\n\n### What's the difference between feature detection, feature inference, and using the UA string?\n\n### Explain AJAX in as much detail as possible.\n\n### Explain how JSONP works (and how it's not really AJAX).\n\n### Have you ever used JavaScript templating?\n\n- If so, what libraries have you used?\n\n### Explain \"hoisting\".\n\n### Describe event bubbling.\n\n### What's the difference between an \"attribute\" and a \"property\"?\n\n### Why is extending built-in JavaScript objects not a good idea?\n\n### Difference between document load event and document ready event?\n\n### What is the difference between == and ===?\n\n### Explain the same-origin policy with regards to JavaScript.\n\n### Make this work:\n\n`duplicate([1,2,3,4,5]); // [1,2,3,4,5,1,2,3,4,5]`\n\nI would use the array prototype method `concat`. \nHow this works is that you take an initial array, which would be the argument, and call on it the `concat` method with argument the exact same argument.\nThis would work:\n```\nvar duplicate = function dupfunction(initialArray) {\n    var newArray = initialArray.concat(initialArray);\n    return newArray;\n};\nduplicate([1,2,3,4,5]);\n```\nIf you wanted to log this out, just `console.log(duplicate([1,2,3,4,5]));`.\n### Why is it called a Ternary expression, what does the word \"Ternary\" indicate?\n\n### What is \"use strict\";? what are the advantages and disadvantages to using it?\n\n### Create a for loop that iterates up to 100 while outputting \"fizz\" at multiples of 3, \"buzz\" at multiples of 5 and \"fizzbuzz\" at multiples of 3 and 5\n\nFirst I would declare a variable i.\n```\nvar i;\n```\nThe for loop would look like this:\n```\nfor(i = 1; i<=100; i++) {}\n```\nNow we write a conditional statement for our variable i.\nWhat if i is divisible by 15? Output fizzbuzz.\n```\nfor(i=1; i <= 100; i++) {\n    if (i % 15 === 0) {\n        console.log(\"fizzbuzz\");\n    }\n}\n```\nThen I would add 3 more conditions: if i is divisible by 3, output \"fizz\"; if i is divisible by 5, output \"buzz\"; and otherwise, just output i -- the number.\n```\nvar i;\nfor(i=1; i <= 100; i++) {\n    if (i % 15 === 0) {\n        console.log(\"fizzbuzz\");\n    } else if (i % 3 === 0) {\n        console.log(\"fizz\");\n    } else if (i % 5 === 0) {\n        console.log(\"buzz\");\n    } else {\n        console.log(i);\n    }\n}\n```\n\n### Why is it, in general, a good idea to leave the global scope of a website as-is and never touch it?\n\n### Why would you use something like the load event? Does this event have disadvantages? Do you know any alternatives, and why would you use those?\n\n### Explain what a single page app is and how to make one SEO-friendly.\n\n### What is the extent of your experience with Promises and/or their polyfills?\n\n### What are the pros and cons of using Promises instead of callbacks?\n\n### What are some of the advantages/disadvantages of writing JavaScript code in a language that compiles to JavaScript?\n\n### What tools and techniques do you use debugging JavaScript code?\n\n### What language constructions do you use for iterating over object properties and array items?\n\n### Explain the difference between mutable and immutable objects.\n\n- What is an example of an immutable object in JavaScript?\n\n- What are the pros and cons of immutability?\n\n- How can you achieve immutability in your own code?\n\n### Explain the difference between synchronous and asynchronous functions.\n\nAsync functions go over to the browser api and run. Like setTimeout would go over there while JS goes through it's stack. When the setTimeout finishes it goes to the task queue and the event  loop pushes it to the stack when it has cleared.\n\n### What is event loop?\n\n- What is the difference between call stack and task queue?\n\n\n## Testing Questions\n\n### What are some advantages/disadvantages to testing your code?\n\n### What tools would you use to test your code's functionality?\n\n### What is the difference between a unit test and a functional/integration test?\n\n### What is the purpose of a code style linting tool?\n\n## Performance Questions\n\n### What tools would you use to find a performance bug in your code?\n\n### What are some ways you may improve your website's scrolling performance?\n\n### Explain the difference between layout, painting and compositing.\n\n## Network Questions\n\n### Traditionally, why has it been better to serve site assets from multiple domains?\n\n### Do your best to describe the process from the time you type in a website's URL to it finishing loading on your screen.\n\n### What are the differences between Long-Polling, Websockets and Server-Sent Events?\n\n### Explain the following request and response headers:\n\n- Diff. between Expires, Date, Age and If-Modified-...\n\n- Do Not Track\n\n- Cache-Control\n\n- Transfer-Encoding\n\n- ETag\n\n- X-Frame-Options\n\n### What are HTTP actions? List all HTTP actions that you know, and explain them.\n\n## Coding Questions\n\n### Question: What is the value of foo?\n\n`var foo = 10 + '20';`\n\nJavaScript will concatenate the right-hand side reference to produce the string \"1020”. Because, if you add a non-string value to a string, the value will be converted to a string and then concatenated, which means chained or linked together. Therefore, with 10 + “20”, 10 gets converted to the string “10” and then linked to “20” to make “1020”.\n\n### Question: How would you make this work?\n\n`add(2, 5); // 7`\n\n`add(2)(5); // 7`\n\nThese are both functions. The first function, or method, takes two arguments and adds them together. If I was to construct this function, I would do this:\n```\nfunction add(x, y) {\n  return x + y;\n}\nconsole.log(add(2, 5));  // 7\n```\nThe second \"add\" function actually has another function within it that is being returned and called immediately. To construct this:\n```\nvar add = function (x) {\n  return function(y) {\n    return x + y;\n  };\n};\n\nconsole.log(add(2)(5)); // 7\n```\n### Question: What value is returned from the following statement?\n\n`\"I'm a lasagna hog\".split(\"\").reverse().join(\"”);`\n\nThe string object of \"I'm a lasagna hog\" is split into an array of strings, which would simply look like this:\n```\n[\"I\", \"'\", \"m\", \" \", \"a\", \" \", \"l\", \"a\", \"s\", \"a\", \"g\", \"n\", \"a\", \" \", \"h\", \"o\", \"g\"]\n```\nThe `reverse()` method would then take that array and turn it around completely, so it would look like this:\n```\n[\"g\", \"o\", \"h\", \" \", \"a\", \"n\", \"g\", \"a\", \"s\", \"a\", \"l\", \" \", \"a\", \" \", \"m\", \"'\", \"I\"]\n```\nFinally, the `join()` method would join all the elements that make up the array into a single string. Array elements would be separated by a comma, so we use the \"\" separator so that we get the following:\n```\n\"goh angasal a m'I\"\n```\n### Question: What is the value of window.foo?\n\n`( window.foo || ( window.foo = \"bar\" ) );`\n`window.foo` would be equal to `\"bar\"` since \n\n### Question: What is the outcome of the two alerts below?\n```\nvar foo = \"Hello\";\n(function() {\n  var bar = \" World\";\n  alert(foo + bar);\n})();\nalert(foo + bar);\n```\nYou would get a nice big `Hello World` alert and then a reference error because `bar` is not defined for the second alert. Variable `foo` is declared in the global scope and then we have an immediately invoked function expression with variable `bar` declared with a right-hand side reference to `\" World\"` and an `alert` concatenating foo and bar. Finally there is an alert concatenating foo and bar, but bar isn't defined anywhere except the scope of the IIFE. \n### Question: What is the value of foo.length?\n```\nvar foo = [];\nfoo.push(1);\nfoo.push(2);\n```\nVariable `foo` is declared, then it is given the value of an empty array `[]`. The `push` method adds the number 1 to the end of the array and returns the length of the array. Then the `push` method again runs and adds 2 to the end of the array and returns its length. If we ran `foo.length` we would get 2 since the array has 2 items in it.\n### Question: What is the value of foo.x?\n```\nvar foo = {n: 1};\nvar bar = foo;\nfoo.x = foo = {n: 2};\n```\nHere is how JavaScript would compile and run this:\n\nVariable `foo` is declared in the global scope. Variable `bar` is declared in the global scope. Variable `foo` equals an object with property `n` and value `1`. Variable `bar` is set to equal `foo`. Since `foo` doesn't have a property of `x` it would be created by the JavaScript engine and set to equal `foo`, which would be a circular object--a reference to itself. BUT, suddenly `foo` is changed to equal an object with property `n` equal to `2`. There now is no property x inside foo. Therefore, `foo.x = undefined`.\n\n### Question: What does the following code print?\n```\nconsole.log('one');\nsetTimeout(function() {\n  console.log('two');\n}, 0);\nconsole.log('three');\n```\n`setTimeout` calls a function or executes a code snippet after a specified delay. In this sequence, setTimeout calls a function that logs the string `two` after `0` milliseconds. How JavaScript process this code is that it compiles any declarations (there are none) and then the engine runs the code. It would log to the console `one`, then `three`, and then `two`. This is because the `setTimeout` method has a minimum delay (even though it is set to 0 milliseconds). The function to print `two` only happens after that delay, but `one` and `three` print in order from top to bottom as the JavaScript engine processes those functions.\n## Fun Questions:\n\n- What's a cool project that you've recently worked on?\n- What are some things you like about the developer tools you use?\n- Do you have any pet projects? What kind?\n- What's your favorite feature of Internet Explorer?\n- How do you like your coffee?\n\n## Peter Questions\n### Angular\nAngular is a client side JavaScript framework for adding interactivity to HTML. Angular answers the question: how do we tell our HTML when to trigger our JavaScript? Angular accomplishes this by using *directives*. A directive is a marker on an HTML tag that tells Angular to run or reference some JavaScript--it binds the behavior. \"ng-app\" creates an angular application by running a Angular module when the document loads. Everything inside the tag is in the Angular app and you can then insert dynamic values or *expressions*. To get data onto the page, you use *controllers*.\n\n### Explain an implementation of CommonJS modules\nModules are a way to organize your code into separate chunks. To implement CommonJS modules, you add `module.exports = ...` to code that other files can then `requre`. When another file `require`s another, that module is cached so that there is no need to perform subsequent `require`s in other modules that will use it.\n\n### Write a function that takes a string and prints the string and it’s substrings. For example, an input of “cake” would print:\n\ncake\ncak\nake\nca\nak\nke\nc\na\nk\ne\n\nPrint index 0, 0+1, 0+1+2, 0+1+2+3\nPrint index 1, 1+2, 1+2+3\nPrint index 2, 2+3,\nPrint index 3\n```\nfunction stringPrint(text) {\n  var textArray = text.split(\"\");\n  textArray.forEach(function(letter) {\n    console.log(letter);\n    var concat = letter;\n    for(var i = text.indexOf(letter) + 1; i < textArray.length; i++) {\n      concat += textArray[i];\n      console.log(concat);\n    }\n  });\n}\n\nstringPrint(\"cake\");\n```\n### Make a function called isMatch(string1, string2) that will return true if the strings match, and false if they don't. The rules are that each letter in string2 must match a letter in string1... Except that an asterisk in string1 can stand for 0 to infinity repeats of the string1's previous character to the corresponding part in string2.\n\n### Write a function for the longest string in a sentence\n\n```\nfunction longestWord(sentence) {\n\n  // Remove Punctuation\n  var noPunc = sentence.replace(/[.,-\\/#!$%\\^&\\*;:{}=\\-_`~()]/g, \"\");\n\n  // Split the sentence into an array\n  var senArray = noPunc.split(\" \");\n\n  // Sort the array by word length\n  senArray.sort(function(a, b) {\n\n    // use 'b' first to have the right direction\n    return b.length - a.length;\n  });\n\n  // Assign the first item in the array to sentence\n  sentence = senArray[0];\n\n  return sentence; \n}\n```\n\n"
    }
  ]
}